Revit 2024 API
BuiltInFailures.CutFailures.CannotCutRoof Property
 The roof couldn't be cut.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCutRoof { get; }
Visual Basic
Public Shared ReadOnly Property CannotCutRoof As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCutRoof {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CutFailures Class
Autodesk.Revit.DB Namespace